Examples/ConservativeDBSPaper/DBS/micromodel_1200by1200_heteroSquares/Allrun.sh
./createMesh.sh > createMesh.out 2>&1
./initCaseFlow.sh > initCaseFlow.out 2>&1
./runCaseFlow.sh > runCaseFlow.out 2>&1
./processFlow.sh > processFlow.out 2>&1
