Examples/ConservativeDBSPaper/DBS/micromodel_1200by1200_heteroSquares/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


regions
(
    boxToCell
    {
        box (0 0.5e-3 0) (1e-4 1e-3 1e-4);
        fieldValues
        (
            volScalarFieldValue p 0.001 
        );
    }
);


// ************************************************************************* //
